app/views/progresses/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, "Select User", class: "form-label" %>
    <%= form.collection_select :user_id, User.all, :id, :username,
          { prompt: "Choose a user" },
          { class: "form-select" } %>

SELECT "challenges".* FROM "challenges"
---
    <%= form.label :challenge_id, "Select Challenge", class: "form-label" %>
    <%= form.collection_select :challenge_id, Challenge.all, :id, :name,
          { prompt: "Choose a challenge" },
          { class: "form-select" } %>