app/views/challenges/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, "Select Creator" %><br>
    <%= form.collection_select :user_id, User.all, :id, :username, prompt: "Choose a user" %>