app/controllers/challenges_controller.rb

  def index
    @challenges = Challenge.all
---
SELECT "challenges".* FROM "challenges"

  def create
    @challenge = Challenge.new(challenge_params)

    respond_to do |format|
      if @challenge.save
---
INSERT INTO "challenges" ("goal", "name", "description", "categories", "start_date", "end_date", "user_id", "created_at", "updated_at") VALUES ('Leer 3 libros en 30 días', 'dsadsa', 'dasdasd', 'adsad', '2025-10-01', '2025-10-09', 9, '2025-10-26 19:31:31.129945', '2025-10-26 19:31:31.129945') RETURNING "id"

  def update
    respond_to do |format|
      if @challenge.update(challenge_params)
---
UPDATE "challenges" SET "name" = 'antonia', "categories" = 'felciidad', "updated_at" = '2025-10-26 20:30:07.708277' WHERE "challenges"."id" = 11

  def destroy
    @challenge.destroy!
---
DELETE FROM "challenges" WHERE "challenges"."id" = 4

    def set_challenge
      @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 4 LIMIT 1