app/controllers/progresses_controller.rb

SELECT "progresses".* FROM "progresses"
---
  def index
    @progresses = Progress.all

INSERT INTO "progresses" ("user_id", "challenge_id", "points_earned", "update_frequency", "created_at", "updated_at") VALUES (11, 1, 5, '4', '2025-10-26 19:16:46.240473', '2025-10-26 19:16:46.240473') RETURNING "id"
---
  def create
    @progress = Progress.new(progress_params)

    respond_to do |format|
      if @progress.save

UPDATE "progresses" SET "update_frequency" = 'week', "updated_at" = '2025-10-26 19:16:52.924563' WHERE "progresses"."id" = 5
---
  def update
    respond_to do |format|
      if @progress.update(progress_params)

DELETE FROM "progresses" WHERE "progresses"."id" = 6
---
  def destroy
    @progress.destroy!

SELECT "progresses".* FROM "progresses" WHERE "progresses"."id" = 1 LIMIT 1
---
    def set_progress
      @progress = Progress.find(params.expect(:id))