app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "role", "badges", "created_at", "updated_at") VALUES ('hola', 'siuuu', 'aaa', 'kk', 1, '2025-10-02 00:05:56.771652', '2025-10-02 00:05:56.771652') RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = 'a', "email" = 'a', "password" = 'aa', "role" = 'aa', "badges" = -1, "updated_at" = '2025-10-26 18:38:23.887683' WHERE "users"."id" = 12

  def destroy
    @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = 1

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1